<a href="https://colab.research.google.com/github/Dhanashree-pawar/Salary-prediction/blob/main/Untitled3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
df = pd.read_csv("dataset_1.csv")
df.head()

  company                  job     degree  salary_more_than_100k
0  google      sales executive  bachleors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachleors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachleors                      0

In [5]:
inputes = df.drop("salary_more_than_100k", axis = 'columns')
target = df['salary_more_than_100k']

In [6]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_than_100k, dtype: int64

In [13]:
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [19]:
inputes['company_n'] = le_company.fit_transform(inputes['company'])
inputes['job_n'] = le_company.fit_transform(inputes['job'])
inputes['degree_n'] = le_company.fit_transform(inputes['degree'])
inputes.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachleors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachleors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachleors          2      1         0

In [20]:
inputes_n = inputes.drop(['company', 'job', 'degree'], axis = 'columns')
inputes_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           0      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [21]:
from sklearn import tree

In [22]:
model = tree.DecisionTreeClassifier()

In [23]:
model.fit(inputes_n, target)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [24]:
model.score(inputes_n, target)

1.0

In [28]:
model.predict([[2,1,0]])

array([0])